package com.lindonge.core.thirdparty.qqwry;


import org.apache.commons.lang3.StringUtils;

import java.util.HashMap;
import java.util.HashSet;
import java.util.Map;
import java.util.Set;

public class AreaUtils {
    private static final String PCAD = "北京$北京,东城区,西城区,海淀区,朝阳区,崇文区,宣武区,丰台区,石景山区,房山区,门头沟区,通州区,顺义区,昌平区,怀柔区,平谷区,大兴区,密云县,延庆县#上海$上海,长宁区,闸北区,闵行区,徐汇区,浦东新区,杨浦区,普陀区,静安区,卢湾区,虹口区,黄浦区,南汇区,松江区,嘉定区,宝山区,青浦区,金山区,奉贤区,崇明县#天津$天津,和平区,河西区,南开区,河北区,河东区,红桥区,东丽区,津南区,西青区,北辰区,塘沽区,汉沽区,大港区,武清区,宝坻区,经济开发区,宁河县,静海县,蓟县#重庆$重庆,合川区,江津区,南川区,永川区,南岸区,渝北区,万盛区,大渡口区,万州区,北碚区,沙坪坝区,巴南区,涪陵区,江北区,九龙坡区,渝中区,黔江开发区,长寿区,双桥区,綦江县,潼南县,铜梁县,大足县,荣昌县,璧山县,垫江县,武隆县,丰都县,城口县,梁平县,开县,巫溪县,巫山县,奉节县,云阳县,忠县,石柱,彭水,酉阳,秀山#安徽$安庆,迎江区,大观区,宜秀区,桐城市,怀宁县,枞阳县,潜山县,太湖县,宿松县,望江县,岳西县|蚌埠,中市区,东市区,西市区,郊区,怀远县,五河县,固镇县|巢湖,居巢区,庐江县,无为县,含山县,和县|池州,贵池区,东至县,石台县,青阳县|滁州,琅琊区,南谯区,天长市,明光市,来安县,全椒县,定远县,凤阳县|阜阳,蚌山区,龙子湖区,禹会区,淮上区,颍州区,颍东区,颍泉区,界首市,临泉县,太和县,阜南县,颖上县|淮北,相山区,杜集区,烈山区,濉溪县|淮南,田家庵区,大通区,谢家集区,八公山区,潘集区,凤台县|黄山,屯溪区,黄山区,徽州区,歙县,休宁县,黟县,祁门县|六安,金安区,裕安区,寿县,霍邱县,舒城县,金寨县,霍山县|马鞍山,雨山区,花山区,金家庄区,当涂县|宿州,埇桥区,砀山县,萧县,灵璧县,泗县|铜陵,铜官山区,狮子山区,郊区,铜陵县|芜湖,镜湖区,弋江区,鸠江区,三山区,芜湖县,繁昌县,南陵县|宣城,宣州区,宁国市,郎溪县,广德县,泾县,绩溪县,旌德县|亳州,涡阳县,蒙城县,利辛县,谯城区|合肥,庐阳区,瑶海区,蜀山区,包河区,长丰县,肥东县,肥西县#福建$福州,鼓楼区,台江区,仓山区,马尾区,晋安区,福清市,长乐市,闽侯县,连江县,罗源县,闽清县,永泰县,平潭县|龙岩,新罗区,漳平市,长汀县,永定县,上杭县,武平县,连城县|南平,延平区,邵武市,武夷山市,建瓯市,建阳市,顺昌县,浦城县,光泽县,松溪县,政和县|宁德,蕉城区,福安市,福鼎市,霞浦县,古田县,屏南县,寿宁县,周宁县,柘荣县|莆田,城厢区,涵江区,荔城区,秀屿区,仙游县|泉州,鲤城区,丰泽区,洛江区,清濛开发区,泉港区,石狮市,晋江市,南安市,惠安县,安溪县,永春县,德化县,金门县|三明,梅列区,三元区,永安市,明溪县,清流县,宁化县,大田县,尤溪县,沙县,将乐县,泰宁县,建宁县|厦门,思明区,海沧区,湖里区,集美区,同安区,翔安区|漳州,芗城区,龙文区,龙海市,云霄县,漳浦县,诏安县,长泰县,东山县,南靖县,平和县,华安县#甘肃$兰州,皋兰县,城关区,七里河区,西固区,安宁区,红古区,永登县,榆中县|白银,白银区,平川区,会宁县,景泰县,靖远县|定西,临洮县,陇西县,通渭县,渭源县,漳县,岷县,安定区,安定区|甘南,合作市,临潭县,卓尼县,舟曲县,迭部县,玛曲县,碌曲县,夏河县|嘉峪关,嘉峪关市|金昌,金川区,永昌县|酒泉,肃州区,玉门市,敦煌市,金塔县,瓜州县,肃北,阿克塞|临夏,临夏市,临夏县,康乐县,永靖县,广河县,和政县,东乡族自治县,积石山|陇南,成县,徽县,康县,礼县,两当县,文县,西和县,宕昌县,武都区|平凉,崇信县,华亭县,静宁县,灵台县,崆峒区,庄浪县,泾川县|庆阳,合水县,华池县,环县,宁县,庆城县,西峰区,镇原县,正宁县|天水,甘谷县,秦安县,清水县,秦州区,麦积区,武山县,张家川|武威,古浪县,民勤县,天祝,凉州区|张掖,高台县,临泽县,民乐县,山丹县,肃南,甘州区#广东$广州,从化市,天河区,东山区,白云区,海珠区,荔湾区,越秀区,黄埔区,番禺区,花都区,增城区,从化区,市郊|深圳,福田区,罗湖区,南山区,宝安区,龙岗区,盐田区|潮州,湘桥区,潮安县,饶平县|东莞,南城区,东城区,万江区,莞城区,石龙镇,虎门镇,麻涌镇,道滘镇,石碣镇,沙田镇,望牛墩镇,洪梅镇,茶山镇,寮步镇,大岭山镇,大朗镇,黄江镇,樟木头,凤岗镇,塘厦镇,谢岗镇,厚街镇,清溪镇,常平镇,桥头镇,横沥镇,东坑镇,企石镇,石排镇,长安镇,中堂镇,高埗镇|佛山,禅城区,南海区,顺德区,三水区,高明区|河源,东源县,和平县,源城区,连平县,龙川县,紫金县|惠州,惠阳区,惠城区,大亚湾,博罗县,惠东县,龙门县|江门,江海区,蓬江区,新会区,台山市,开平市,鹤山市,恩平市|揭阳,榕城区,普宁市,揭东县,揭西县,惠来县|茂名,茂南区,茂港区,高州市,化州市,信宜市,电白县|梅州,梅县,梅江区,兴宁市,大埔县,丰顺县,五华县,平远县,蕉岭县|清远,清城区,英德市,连州市,佛冈县,阳山县,清新县,连山,连南|汕头,南澳县,潮阳区,澄海区,龙湖区,金平区,濠江区,潮南区|汕尾,城区,陆丰市,海丰县,陆河县|韶关,曲江县,浈江区,武江区,曲江区,乐昌市,南雄市,始兴县,仁化县,翁源县,新丰县,乳源|阳江,江城区,阳春市,阳西县,阳东县|云浮,云城区,罗定市,新兴县,郁南县,云安县|湛江,赤坎区,霞山区,坡头区,麻章区,廉江市,雷州市,吴川市,遂溪县,徐闻县|肇庆,肇庆市,高要市,四会市,广宁县,怀集县,封开县,德庆县|中山,石岐街道,东区街道,西区街道,环城街道,中山港街道,五桂山街道|珠海,香洲区,斗门区,金湾区#广西$南宁,邕宁区,青秀区,兴宁区,良庆区,西乡塘区,江南区,武鸣县,隆安县,马山县,上林县,宾阳县,横县|桂林,秀峰区,叠彩区,象山区,七星区,雁山区,阳朔县,临桂县,灵川县,全州县,平乐县,兴安县,灌阳县,荔浦县,资源县,永福县,龙胜,恭城|百色,右江区,凌云县,平果县,西林县,乐业县,德保县,田林县,田阳县,靖西县,田东县,那坡县,隆林|北海,海城区,银海区,铁山港区,合浦县|崇左,江州区,凭祥市,宁明县,扶绥县,龙州县,大新县,天等县|防城港,港口区,防城区,东兴市,上思县|贵港,港北区,港南区,覃塘区,桂平市,平南县|河池,金城江区,宜州市,天峨县,凤山县,南丹县,东兰县,都安,罗城,巴马,环江,大化|贺州,八步区,钟山县,昭平县,富川|来宾,兴宾区,合山市,象州县,武宣县,忻城县,金秀|柳州,城中区,鱼峰区,柳北区,柳南区,柳江县,柳城县,鹿寨县,融安县,融水,三江|钦州,钦南区,钦北区,灵山县,浦北县|梧州,万秀区,蝶山区,长洲区,岑溪市,苍梧县,藤县,蒙山县|玉林,玉州区,北流市,容县,陆川县,博白县,兴业县#贵州$贵阳,南明区,云岩区,花溪区,乌当区,白云区,小河区,金阳新区,新天园区,清镇市,开阳县,修文县,息烽县|安顺,西秀区,关岭,镇宁,紫云,平坝县,普定县|毕节,毕节市,大方县,黔西县,金沙县,织金县,纳雍县,赫章县,威宁|六盘水,钟山区,六枝特区,水城县,盘县|黔东南,凯里市,黄平县,施秉县,三穗县,镇远县,岑巩县,天柱县,锦屏县,剑河县,台江县,黎平县,榕江县,从江县,雷山县,麻江县,丹寨县|黔南,都匀市,福泉市,荔波县,贵定县,瓮安县,独山县,平塘县,罗甸县,长顺县,龙里县,惠水县,三都|黔西南,兴义市,兴仁县,普安县,晴隆县,贞丰县,望谟县,册亨县,安龙县|铜仁,铜仁市,江口县,石阡县,思南县,德江县,玉屏,印江,沿河,松桃,万山特区|遵义,红花岗区,务川县,道真县,汇川区,赤水市,仁怀市,遵义县,桐梓县,绥阳县,正安县,凤冈县,湄潭县,余庆县,习水县,道真,务川#海南$海口,秀英区,龙华区,琼山区,美兰区|三亚|白沙|保亭|昌江|澄迈县|定安县|东方|乐东|临高县|陵水|琼海|琼中|屯昌县|万宁|文昌|五指山|儋州,市区,洋浦开发区,那大镇,王五镇,雅星镇,大成镇,中和镇,峨蔓镇,南丰镇,白马井镇,兰洋镇,和庆镇,海头镇,排浦镇,东成镇,光村镇,木棠镇,新州镇,三都镇,其他#河北$石家庄,长安区,桥东区,桥西区,新华区,裕华区,井陉矿区,高新区,辛集市,藁城市,晋州市,新乐市,鹿泉市,井陉县,正定县,栾城县,行唐县,灵寿县,高邑县,深泽县,赞皇县,无极县,平山县,元氏县,赵县|保定,新市区,南市区,北市区,涿州市,定州市,安国市,高碑店市,满城县,清苑县,涞水县,阜平县,徐水县,定兴县,唐县,高阳县,容城县,涞源县,望都县,安新县,易县,曲阳县,蠡县,顺平县,博野县,雄县|沧州,运河区,新华区,泊头市,任丘市,黄骅市,河间市,沧县,青县,东光县,海兴县,盐山县,肃宁县,南皮县,吴桥县,献县,孟村|承德,双桥区,双滦区,鹰手营子矿区,承德县,兴隆县,平泉县,滦平县,隆化县,丰宁,宽城,围场|邯郸,从台区,复兴区,邯山区,峰峰矿区,武安市,邯郸县,临漳县,成安县,大名县,涉县,磁县,肥乡县,永年县,邱县,鸡泽县,广平县,馆陶县,魏县,曲周县|衡水,桃城区,冀州市,深州市,枣强县,武邑县,武强县,饶阳县,安平县,故城县,景县,阜城县|廊坊,安次区,广阳区,霸州市,三河市,固安县,永清县,香河县,大城县,文安县,大厂|秦皇岛,海港区,山海关区,北戴河区,昌黎县,抚宁县,卢龙县,青龙|唐山,路北区,路南区,古冶区,开平区,丰南区,丰润区,遵化市,迁安市,滦县,滦南县,乐亭县,迁西县,玉田县,唐海县|邢台,桥东区,桥西区,南宫市,沙河市,邢台县,临城县,内丘县,柏乡县,隆尧县,任县,南和县,宁晋县,巨鹿县,新河县,广宗县,平乡县,威县,清河县,临西县|张家口,桥西区,桥东区,宣化区,下花园区,宣化县,张北县,康保县,沽源县,尚义县,蔚县,阳原县,怀安县,万全县,怀来县,涿鹿县,赤城县,崇礼县#河南$郑州,金水区,邙山区,二七区,管城区,中原区,上街区,惠济区,郑东新区,经济技术开发区,高新开发区,出口加工区,巩义市,荥阳市,新密市,新郑市,登封市,中牟县|洛阳,西工区,老城区,涧西区,瀍河回族区,洛龙区,吉利区,偃师市,孟津县,新安县,栾川县,嵩县,汝阳县,宜阳县,洛宁县,伊川县|开封,鼓楼区,龙亭区,顺河回族区,金明区,禹王台区,杞县,通许县,尉氏县,开封县,兰考县|安阳,北关区,文峰区,殷都区,龙安区,林州市,安阳县,汤阴县,滑县,内黄县|鹤壁,淇滨区,山城区,鹤山区,浚县,淇县|济源,济源市|焦作,解放区,中站区,马村区,山阳区,沁阳市,孟州市,修武县,博爱县,武陟县,温县|南阳,卧龙区,宛城区,邓州市,南召县,方城县,西峡县,镇平县,内乡县,淅川县,社旗县,唐河县,新野县,桐柏县|平顶山,新华区,卫东区,湛河区,石龙区,舞钢市,汝州市,宝丰县,叶县,鲁山县,郏县|三门峡,湖滨区,义马市,灵宝市,渑池县,陕县,卢氏县|商丘,梁园区,睢阳区,永城市,民权县,睢县,宁陵县,虞城县,柘城县,夏邑县|新乡,卫滨区,红旗区,凤泉区,牧野区,卫辉市,辉县市,新乡县,获嘉县,原阳县,延津县,封丘县,长垣县|信阳,浉河区,平桥区,罗山县,光山县,新县,商城县,固始县,潢川县,淮滨县,息县|许昌,魏都区,禹州市,长葛市,许昌县,鄢陵县,襄城县|周口,川汇区,项城市,扶沟县,西华县,商水县,沈丘县,郸城县,淮阳县,太康县,鹿邑县|驻马店,驿城区,西平县,上蔡县,平舆县,正阳县,确山县,泌阳县,汝南县,遂平县,新蔡县|漯河,郾城区,源汇区,召陵区,舞阳县,临颍县|濮阳,华龙区,清丰县,南乐县,范县,台前县,濮阳县#黑龙江$哈尔滨,道里区,南岗区,动力区,平房区,香坊区,太平区,道外区,阿城区,呼兰区,松北区,尚志市,双城市,五常市,方正县,宾县,依兰县,巴彦县,通河县,木兰县,延寿县|大庆,萨尔图区,红岗区,龙凤区,让胡路区,大同区,肇州县,肇源县,林甸县,杜尔伯特|大兴安岭,呼玛县,漠河县,塔河县|鹤岗,兴山区,工农区,南山区,兴安区,向阳区,东山区,萝北县,绥滨县|黑河,爱辉区,五大连池市,北安市,嫩江县,逊克县,孙吴县|鸡西,鸡冠区,恒山区,城子河区,滴道区,梨树区,虎林市,密山市,鸡东县|佳木斯,前进区,郊区,向阳区,东风区,同江市,富锦市,桦南县,桦川县,汤原县,抚远县|牡丹江,爱民区,东安区,阳明区,西安区,绥芬河市,海林市,宁安市,穆棱市,东宁县,林口县|七台河,桃山区,新兴区,茄子河区,勃利县|齐齐哈尔,龙沙区,昂昂溪区,铁峰区,建华区,富拉尔基区,碾子山区,梅里斯达斡尔区,讷河市,龙江县,依安县,泰来县,甘南县,富裕县,克山县,克东县,拜泉县|双鸭山,尖山区,岭东区,四方台区,宝山区,集贤县,友谊县,宝清县,饶河县|绥化,北林区,安达市,肇东市,海伦市,望奎县,兰西县,青冈县,庆安县,明水县,绥棱县|伊春,伊春区,带岭区,南岔区,金山屯区,西林区,美溪区,乌马河区,翠峦区,友好区,上甘岭区,五营区,红星区,新青区,汤旺河区,乌伊岭区,铁力市,嘉荫县#湖北$武汉,江岸区,武昌区,江汉区,硚口区,汉阳区,青山区,洪山区,东西湖区,汉南区,蔡甸区,江夏区,黄陂区,新洲区,经济开发区|仙桃,仙桃市|鄂州,鄂城区,华容区,梁子湖区|黄冈,黄州区,麻城市,武穴市,团风县,红安县,罗田县,英山县,浠水县,蕲春县,黄梅县|黄石,黄石港区,西塞山区,下陆区,铁山区,大冶市,阳新县|荆门,东宝区,掇刀区,钟祥市,京山县,沙洋县|荆州,沙市区,荆州区,石首市,洪湖市,松滋市,公安县,监利县,江陵县|潜江,潜江市|神农架林区,神农架林区|十堰,张湾区,茅箭区,丹江口市,郧县,郧西县,竹山县,竹溪县,房县|随州,曾都区,广水市|天门,天门市|咸宁,咸安区,赤壁市,嘉鱼县,通城县,崇阳县,通山县|襄樊,襄城区,樊城区,襄阳区,老河口市,枣阳市,宜城市,南漳县,谷城县,保康县|孝感,孝南区,应城市,安陆市,汉川市,孝昌县,大悟县,云梦县|宜昌,长阳,五峰,西陵区,伍家岗区,点军区,猇亭区,夷陵区,宜都市,当阳市,枝江市,远安县,兴山县,秭归县|恩施,恩施市,利川市,建始县,巴东县,宣恩县,咸丰县,来凤县,鹤峰县#湖南$长沙,岳麓区,芙蓉区,天心区,开福区,雨花区,开发区,浏阳市,长沙县,望城县,宁乡县|张家界,永定区,武陵源区,慈利县,桑植县|常德,武陵区,鼎城区,津市市,安乡县,汉寿县,澧县,临澧县,桃源县,石门县|郴州,北湖区,苏仙区,资兴市,桂阳县,宜章县,永兴县,嘉禾县,临武县,汝城县,桂东县,安仁县|衡阳,雁峰区,珠晖区,石鼓区,蒸湘区,南岳区,耒阳市,常宁市,衡阳县,衡南县,衡山县,衡东县,祁东县|怀化,鹤城区,靖州,麻阳,通道,新晃,芷江,沅陵县,辰溪县,溆浦县,中方县,会同县,洪江市|娄底,娄星区,冷水江市,涟源市,双峰县,新化县|邵阳,城步,双清区,大祥区,北塔区,武冈市,邵东县,新邵县,邵阳县,隆回县,洞口县,绥宁县,新宁县|湘潭,岳塘区,雨湖区,湘乡市,韶山市,湘潭县|湘西,吉首市,泸溪县,凤凰县,花垣县,保靖县,古丈县,永顺县,龙山县|益阳,赫山区,资阳区,沅江市,南县,桃江县,安化县|永州,江华,冷水滩区,零陵区,祁阳县,东安县,双牌县,道县,江永县,宁远县,蓝山县,新田县|岳阳,岳阳楼区,君山区,云溪区,汨罗市,临湘市,岳阳县,华容县,湘阴县,平江县|株洲,天元区,荷塘区,芦淞区,石峰区,醴陵市,株洲县,攸县,茶陵县,炎陵县#吉林$长春,朝阳区,宽城区,二道区,南关区,绿园区,双阳区,净月潭开发区,高新技术开发区,经济技术开发区,汽车产业开发区,德惠市,九台市,榆树市,农安县|吉林,船营区,昌邑区,龙潭区,丰满区,蛟河市,桦甸市,舒兰市,磐石市,永吉县|白城,洮北区,洮南市,大安市,镇赉县,通榆县|白山,江源区,八道江区,长白,临江市,抚松县,靖宇县|辽源,龙山区,西安区,东丰县,东辽县|四平,铁西区,铁东区,伊通,公主岭市,双辽市,梨树县|松原,前郭尔罗斯,宁江区,长岭县,乾安县,扶余县|通化,东昌区,二道江区,梅河口市,集安市,通化县,辉南县,柳河县|延边,延吉市,图们市,敦化市,珲春市,龙井市,和龙市,安图县,汪清县#江苏$南京,玄武区,鼓楼区,白下区,建邺区,秦淮区,雨花台区,下关区,栖霞区,浦口区,江宁区,六合区,溧水县,高淳县|苏州,沧浪区,金阊区,平江区,虎丘区,吴中区,相城区,园区,新区,常熟市,张家港市,玉山镇,巴城镇,周市镇,陆家镇,花桥镇,淀山湖镇,张浦镇,周庄镇,千灯镇,锦溪镇,开发区,吴江市,太仓市|无锡,崇安区,北塘区,南长区,锡山区,惠山区,滨湖区,新区,江阴市,宜兴市|常州,天宁区,钟楼区,戚墅堰区,郊区,新北区,武进区,溧阳市,金坛市|淮安,清河区,清浦区,楚州区,淮阴区,涟水县,洪泽县,盱眙县,金湖县|连云港,新浦区,连云区,海州区,赣榆县,东海县,灌云县,灌南县|南通,崇川区,港闸区,经济开发区,启东市,如皋市,通州市,海门市,海安县,如东县|宿迁,宿城区,宿豫区,宿豫县,沭阳县,泗阳县,泗洪县|泰州,海陵区,高港区,兴化市,靖江市,泰兴市,姜堰市|徐州,云龙区,鼓楼区,九里区,贾汪区,泉山区,新沂市,邳州市,丰县,沛县,铜山县,睢宁县|盐城,城区,亭湖区,盐都区,盐都县,东台市,大丰市,响水县,滨海县,阜宁县,射阳县,建湖县|扬州,广陵区,维扬区,邗江区,仪征市,高邮市,江都市,宝应县|镇江,京口区,润州区,丹徒区,丹阳市,扬中市,句容市#江西$南昌,东湖区,西湖区,青云谱区,湾里区,青山湖区,红谷滩新区,昌北区,高新区,南昌县,新建县,安义县,进贤县|抚州,临川区,南城县,黎川县,南丰县,崇仁县,乐安县,宜黄县,金溪县,资溪县,东乡县,广昌县|赣州,章贡区,于都县,瑞金市,南康市,赣县,信丰县,大余县,上犹县,崇义县,安远县,龙南县,定南县,全南县,宁都县,兴国县,会昌县,寻乌县,石城县|吉安,安福县,吉州区,青原区,井冈山市,吉安县,吉水县,峡江县,新干县,永丰县,泰和县,遂川县,万安县,永新县|景德镇,珠山区,昌江区,乐平市,浮梁县|九江,浔阳区,庐山区,瑞昌市,九江县,武宁县,修水县,永修县,德安县,星子县,都昌县,湖口县,彭泽县|萍乡,安源区,湘东区,莲花县,芦溪县,上栗县|上饶,信州区,德兴市,上饶县,广丰县,玉山县,铅山县,横峰县,弋阳县,余干县,波阳县,万年县,婺源县|新余,渝水区,分宜县|宜春,袁州区,丰城市,樟树市,高安市,奉新县,万载县,上高县,宜丰县,靖安县,铜鼓县|鹰潭,月湖区,贵溪市,余江县#辽宁$沈阳,沈河区,皇姑区,和平区,大东区,铁西区,苏家屯区,东陵区,沈北新区,于洪区,浑南新区,新民市,辽中县,康平县,法库县|大连,西岗区,中山区,沙河口区,甘井子区,旅顺口区,金州区,开发区,瓦房店市,普兰店市,庄河市,长海县|鞍山,铁东区,铁西区,立山区,千山区,岫岩,海城市,台安县|本溪,本溪,平山区,明山区,溪湖区,南芬区,桓仁|朝阳,双塔区,龙城区,喀喇沁左翼蒙古族自治县,北票市,凌源市,朝阳县,建平县|丹东,振兴区,元宝区,振安区,宽甸,东港市,凤城市|抚顺,顺城区,新抚区,东洲区,望花区,清原,新宾,抚顺县|阜新,阜新,海州区,新邱区,太平区,清河门区,细河区,彰武县|葫芦岛,龙港区,南票区,连山区,兴城市,绥中县,建昌县|锦州,太和区,古塔区,凌河区,凌海市,北镇市,黑山县,义县|辽阳,白塔区,文圣区,宏伟区,太子河区,弓长岭区,灯塔市,辽阳县|盘锦,双台子区,兴隆台区,大洼县,盘山县|铁岭,银州区,清河区,调兵山市,开原市,铁岭县,西丰县,昌图县|营口,站前区,西市区,鲅鱼圈区,老边区,盖州市,大石桥市#内蒙古$呼和浩特,回民区,玉泉区,新城区,赛罕区,清水河县,土默特左旗,托克托县,和林格尔县,武川县|阿拉善盟,阿拉善左旗,阿拉善右旗,额济纳旗|巴彦淖尔盟,临河区,五原县,磴口县,乌拉特前旗,乌拉特中旗,乌拉特后旗,杭锦后旗|包头,昆都仑区,青山区,东河区,九原区,石拐区,白云矿区,土默特右旗,固阳县,达尔罕茂明安联合旗|赤峰,红山区,元宝山区,松山区,阿鲁科尔沁旗,巴林左旗,巴林右旗,林西县,克什克腾旗,翁牛特旗,喀喇沁旗,宁城县,敖汉旗|鄂尔多斯,东胜区,达拉特旗,准格尔旗,鄂托克前旗,鄂托克旗,杭锦旗,乌审旗,伊金霍洛旗|呼伦贝尔,海拉尔区,莫力达瓦,满洲里市,牙克石市,扎兰屯市,额尔古纳市,根河市,阿荣旗,鄂伦春自治旗,鄂温克族自治旗,陈巴尔虎旗,新巴尔虎左旗,新巴尔虎右旗|通辽,科尔沁区,霍林郭勒市,科尔沁左翼中旗,科尔沁左翼后旗,开鲁县,库伦旗,奈曼旗,扎鲁特旗|乌海,海勃湾区,乌达区,海南区|乌兰察布市,化德县,集宁区,丰镇市,卓资县,商都县,兴和县,凉城县,察哈尔右翼前旗,察哈尔右翼中旗,察哈尔右翼后旗,四子王旗|锡林郭勒盟,二连浩特市,锡林浩特市,阿巴嘎旗,苏尼特左旗,苏尼特右旗,东乌珠穆沁旗,西乌珠穆沁旗,太仆寺旗,镶黄旗,正镶白旗,正蓝旗,多伦县|兴安盟,乌兰浩特市,阿尔山市,科尔沁右翼前旗,科尔沁右翼中旗,扎赉特旗,突泉县#宁夏$银川,西夏区,金凤区,兴庆区,灵武市,永宁县,贺兰县|固原,原州区,海原县,西吉县,隆德县,泾源县,彭阳县|石嘴山,惠农县,大武口区,惠农区,陶乐县,平罗县|吴忠,利通区,中卫县,青铜峡市,中宁县,盐池县,同心县|中卫,沙坡头区,海原县,中宁县#青海$西宁,城中区,城东区,城西区,城北区,湟中县,湟源县,大通|果洛,玛沁县,班玛县,甘德县,达日县,久治县,玛多县|海北,海晏县,祁连县,刚察县,门源|海东,平安县,乐都县,民和,互助,化隆,循化|海南,共和县,同德县,贵德县,兴海县,贵南县|海西,德令哈市,格尔木市,乌兰县,都兰县,天峻县|黄南,同仁县,尖扎县,泽库县,河南蒙古族自治县|玉树,玉树县,杂多县,称多县,治多县,囊谦县,曲麻莱县#山东$济南,市中区,历下区,天桥区,槐荫区,历城区,长清区,章丘市,平阴县,济阳县,商河县|青岛,市南区,市北区,城阳区,四方区,李沧区,黄岛区,崂山区,胶州市,即墨市,平度市,胶南市,莱西市|滨州,滨城区,惠民县,阳信县,无棣县,沾化县,博兴县,邹平县|德州,德城区,陵县,乐陵市,禹城市,宁津县,庆云县,临邑县,齐河县,平原县,夏津县,武城县|东营,东营区,河口区,垦利县,利津县,广饶县|菏泽,牡丹区,曹县,单县,成武县,巨野县,郓城县,鄄城县,定陶县,东明县|济宁,市中区,任城区,曲阜市,兖州市,邹城市,微山县,鱼台县,金乡县,嘉祥县,汶上县,泗水县,梁山县|莱芜,莱城区,钢城区|聊城,东昌府区,临清市,阳谷县,莘县,茌平县,东阿县,冠县,高唐县|临沂,兰山区,罗庄区,河东区,沂南县,郯城县,沂水县,苍山县,费县,平邑县,莒南县,蒙阴县,临沭县|日照,东港区,岚山区,五莲县,莒县|泰安,泰山区,岱岳区,新泰市,肥城市,宁阳县,东平县|威海,荣成市,乳山市,环翠区,文登市|潍坊,潍城区,寒亭区,坊子区,奎文区,青州市,诸城市,寿光市,安丘市,高密市,昌邑市,临朐县,昌乐县|烟台,芝罘区,福山区,牟平区,莱山区,开发区,龙口市,莱阳市,莱州市,蓬莱市,招远市,栖霞市,海阳市,长岛县|枣庄,市中区,山亭区,峄城区,台儿庄区,薛城区,滕州市|淄博,张店区,临淄区,淄川区,博山区,周村区,桓台县,高青县,沂源县#山西$太原,杏花岭区,小店区,迎泽区,尖草坪区,万柏林区,晋源区,高新开发区,民营经济开发区,经济技术开发区,清徐县,阳曲县,娄烦县,古交市|长治,城区,郊区,沁县,潞城市,长治县,襄垣县,屯留县,平顺县,黎城县,壶关县,长子县,武乡县,沁源县|大同,城区,矿区,南郊区,新荣区,阳高县,天镇县,广灵县,灵丘县,浑源县,左云县,大同县|晋城,城区,高平市,沁水县,阳城县,陵川县,泽州县|晋中,榆次区,介休市,榆社县,左权县,和顺县,昔阳县,寿阳县,太谷县,祁县,平遥县,灵石县|临汾,尧都区,侯马市,霍州市,曲沃县,翼城县,襄汾县,洪洞县,吉县,安泽县,浮山县,古县,乡宁县,大宁县,隰县,永和县,蒲县,汾西县|吕梁,离石市,离石区,孝义市,汾阳市,文水县,交城县,兴县,临县,柳林县,石楼县,岚县,方山县,中阳县,交口县|朔州,朔城区,平鲁区,山阴县,应县,右玉县,怀仁县|忻州,忻府区,原平市,定襄县,五台县,代县,繁峙县,宁武县,静乐县,神池县,五寨县,岢岚县,河曲县,保德县,偏关县|阳泉,城区,矿区,郊区,平定县,盂县|运城,盐湖区,永济市,河津市,临猗县,万荣县,闻喜县,稷山县,新绛县,绛县,垣曲县,夏县,平陆县,芮城县#陕西$西安,莲湖区,新城区,碑林区,雁塔区,灞桥区,未央区,阎良区,临潼区,长安区,蓝田县,周至县,户县,高陵县|安康,汉滨区,汉阴县,石泉县,宁陕县,紫阳县,岚皋县,平利县,镇坪县,旬阳县,白河县|宝鸡,陈仓区,渭滨区,金台区,凤翔县,岐山县,扶风县,眉县,陇县,千阳县,麟游县,凤县,太白县|汉中,汉台区,南郑县,城固县,洋县,西乡县,勉县,宁强县,略阳县,镇巴县,留坝县,佛坪县|商洛,商州区,洛南县,丹凤县,商南县,山阳县,镇安县,柞水县|铜川,耀州区,王益区,印台区,宜君县|渭南,临渭区,韩城市,华阴市,华县,潼关县,大荔县,合阳县,澄城县,蒲城县,白水县,富平县|咸阳,秦都区,渭城区,杨陵区,兴平市,三原县,泾阳县,乾县,礼泉县,永寿县,彬县,长武县,旬邑县,淳化县,武功县|延安,吴起县,宝塔区,延长县,延川县,子长县,安塞县,志丹县,甘泉县,富县,洛川县,宜川县,黄龙县,黄陵县|榆林,榆阳区,神木县,府谷县,横山县,靖边县,定边县,绥德县,米脂县,佳县,吴堡县,清涧县,子洲县#四川$成都,青羊区,锦江区,金牛区,武侯区,成华区,龙泉驿区,青白江区,新都区,温江区,高新区,高新西区,都江堰市,彭州市,邛崃市,崇州市,金堂县,双流县,郫县,大邑县,蒲江县,新津县,都江堰市,彭州市,邛崃市,崇州市,金堂县,双流县,郫县,大邑县,蒲江县,新津县|绵阳,涪城区,游仙区,江油市,盐亭县,三台县,平武县,安县,梓潼县,北川县|阿坝,马尔康县,汶川县,理县,茂县,松潘县,九寨沟县,金川县,小金县,黑水县,壤塘县,阿坝县,若尔盖县,红原县|巴中,巴州区,通江县,南江县,平昌县|达州,通川区,万源市,达县,宣汉县,开江县,大竹县,渠县|德阳,旌阳区,广汉市,什邡市,绵竹市,罗江县,中江县|甘孜,康定县,丹巴县,泸定县,炉霍县,九龙县,甘孜县,雅江县,新龙县,道孚县,白玉县,理塘县,德格县,乡城县,石渠县,稻城县,色达县,巴塘县,得荣县|广安,广安区,华蓥市,岳池县,武胜县,邻水县|广元,利州区,元坝区,朝天区,旺苍县,青川县,剑阁县,苍溪县|乐山,峨眉山市,乐山市,犍为县,井研县,夹江县,沐川县,峨边,马边|凉山,西昌市,盐源县,德昌县,会理县,会东县,宁南县,普格县,布拖县,金阳县,昭觉县,喜德县,冕宁县,越西县,甘洛县,美姑县,雷波县,木里|眉山,东坡区,仁寿县,彭山县,洪雅县,丹棱县,青神县|南充,阆中市,南部县,营山县,蓬安县,仪陇县,顺庆区,高坪区,嘉陵区,西充县|内江,市中区,东兴区,威远县,资中县,隆昌县|攀枝花,东  区,西  区,仁和区,米易县,盐边县|遂宁,船山区,安居区,蓬溪县,射洪县,大英县|雅安,雨城区,名山县,荥经县,汉源县,石棉县,天全县,芦山县,宝兴县|宜宾,翠屏区,宜宾县,南溪县,江安县,长宁县,高县,珙县,筠连县,兴文县,屏山县|资阳,雁江区,简阳市,安岳县,乐至县|自贡,大安区,自流井区,贡井区,沿滩区,荣县,富顺县|泸州,江阳区,纳溪区,龙马潭区,泸县,合江县,叙永县,古蔺县#西藏$拉萨,城关区,林周县,当雄县,尼木县,曲水县,堆龙德庆县,达孜县,墨竹工卡县|阿里,噶尔县,普兰县,札达县,日土县,革吉县,改则县,措勤县|昌都,昌都县,江达县,贡觉县,类乌齐县,丁青县,察雅县,八宿县,左贡县,芒康县,洛隆县,边坝县|林芝,林芝县,工布江达县,米林县,墨脱县,波密县,察隅县,朗县|那曲,那曲县,嘉黎县,比如县,聂荣县,安多县,申扎县,索县,班戈县,巴青县,尼玛县|日喀则,日喀则市,南木林县,江孜县,定日县,萨迦县,拉孜县,昂仁县,谢通门县,白朗县,仁布县,康马县,定结县,仲巴县,亚东县,吉隆县,聂拉木县,萨嘎县,岗巴县|山南,乃东县,扎囊县,贡嘎县,桑日县,琼结县,曲松县,措美县,洛扎县,加查县,隆子县,错那县,浪卡子县#新疆$乌鲁木齐,天山区,沙依巴克区,新市区,水磨沟区,头屯河区,达坂城区,米东区,乌鲁木齐县|阿克苏,阿克苏市,温宿县,库车县,沙雅县,新和县,拜城县,乌什县,阿瓦提县,柯坪县|阿拉尔,阿拉尔市|巴音郭楞,库尔勒市,轮台县,尉犁县,若羌县,且末县,焉耆,和静县,和硕县,博湖县|博尔塔拉,博乐市,精河县,温泉县|昌吉,呼图壁县,米泉市,昌吉市,阜康市,玛纳斯县,奇台县,吉木萨尔县,木垒|哈密,哈密市,伊吾县,巴里坤|和田,和田市,和田县,墨玉县,皮山县,洛浦县,策勒县,于田县,民丰县|喀什,喀什市,疏附县,疏勒县,英吉沙县,泽普县,莎车县,叶城县,麦盖提县,岳普湖县,伽师县,巴楚县,塔什库尔干|克拉玛依,克拉玛依市|克孜勒苏,阿图什市,阿克陶县,阿合奇县,乌恰县|石河子,石河子市|图木舒克,图木舒克市|吐鲁番,吐鲁番市,鄯善县,托克逊县|五家渠,五家渠市|伊犁,阿勒泰市,布克赛尔,伊宁市,布尔津县,奎屯市,乌苏市,额敏县,富蕴县,伊宁县,福海县,霍城县,沙湾县,巩留县,哈巴河县,托里县,青河县,新源县,裕民县,和布克赛尔,吉木乃县,昭苏县,特克斯县,尼勒克县,察布查尔#云南$昆明,盘龙区,五华区,官渡区,西山区,东川区,安宁市,呈贡县,晋宁县,富民县,宜良县,嵩明县,石林县,禄劝,寻甸|怒江,兰坪,泸水县,福贡县,贡山|普洱,宁洱,思茅区,墨江,景东,景谷,镇沅,江城,孟连,澜沧,西盟|丽江,古城区,宁蒗,玉龙,永胜县,华坪县|保山,隆阳区,施甸县,腾冲县,龙陵县,昌宁县|楚雄,楚雄市,双柏县,牟定县,南华县,姚安县,大姚县,永仁县,元谋县,武定县,禄丰县|大理,大理市,祥云县,宾川县,弥渡县,永平县,云龙县,洱源县,剑川县,鹤庆县,漾濞,南涧,巍山|德宏,潞西市,瑞丽市,梁河县,盈江县,陇川县|迪庆,香格里拉县,德钦县,维西|红河,泸西县,蒙自县,个旧市,开远市,绿春县,建水县,石屏县,弥勒县,元阳县,红河县,金平,河口,屏边|临沧,临翔区,凤庆县,云县,永德县,镇康县,双江,耿马,沧源|曲靖,麒麟区,宣威市,马龙县,陆良县,师宗县,罗平县,富源县,会泽县,沾益县|文山,文山县,砚山县,西畴县,麻栗坡县,马关县,丘北县,广南县,富宁县|西双版纳,景洪市,勐海县,勐腊县|玉溪,红塔区,江川县,澄江县,通海县,华宁县,易门县,峨山,新平,元江|昭通,昭阳区,鲁甸县,巧家县,盐津县,大关县,永善县,绥江县,镇雄县,彝良县,威信县,水富县#浙江$杭州,西湖区,上城区,下城区,拱墅区,滨江区,江干区,萧山区,余杭区,市郊,建德市,富阳市,临安市,桐庐县,淳安县|湖州,吴兴区,南浔区,德清县,长兴县,安吉县|嘉兴,南湖区,秀洲区,海宁市,嘉善县,平湖市,桐乡市,海盐县|金华,婺城区,金东区,兰溪市,市区,佛堂镇,上溪镇,义亭镇,大陈镇,苏溪镇,赤岸镇,东阳市,永康市,武义县,浦江县,磐安县|丽水,莲都区,龙泉市,青田县,缙云县,遂昌县,松阳县,云和县,庆元县,景宁|宁波,海曙区,江东区,江北区,镇海区,北仑区,鄞州区,余姚市,慈溪市,奉化市,象山县,宁海县|绍兴,越城区,上虞市,嵊州市,绍兴县,新昌县,诸暨市|台州,椒江区,黄岩区,路桥区,温岭市,临海市,玉环县,三门县,天台县,仙居县|温州,鹿城区,龙湾区,瓯海区,瑞安市,乐清市,洞头县,永嘉县,平阳县,苍南县,文成县,泰顺县|舟山,定海区,普陀区,岱山县,嵊泗县|衢州,衢州市,江山市,常山县,开化县,龙游县#香港$香港,沙田区,东区,观塘区,黄大仙区,九龙城区,屯门区,葵青区,元朗区,深水埗区,西贡区,大埔区,湾仔区,油尖旺区,北区,南区,荃湾区,中西区,离岛区#澳门$澳门,澳门#台湾$台湾,台北,高雄,基隆,台中,台南,新竹,嘉义,宜兰县,桃园县,苗栗县,彰化县,南投县,云林县,屏东县,台东县,花莲县,澎湖县";

    private static final Map<String, String> cityProvinceMap = new HashMap<String, String>(); // key=city,val=province
    private static final Set<String> provinceSet = new HashSet<String>();
    private static final Set<String> citySet = new HashSet<String>();
    private static final Set<String> notMatch = new HashSet<String>();

    static {
        String[] p = StringUtils.split(PCAD, "#");
        for (String s : p) {
            String[] pas = StringUtils.split(s, "$");
            String province = pas[0];
            provinceSet.add(province);
            String[] cas = StringUtils.split(pas[1], "|");
            for (String c : cas) {
                String[] ars = StringUtils.split(c, ",");
                String city = ars[0];
                citySet.add(city);
                cityProvinceMap.put(city, province);
            }
        }
        ///////////////////////////////////////////////////////
        notMatch.add("IANA");
        notMatch.add("IANA保留地址");
        notMatch.add("局域网");
        notMatch.add("本机地址");
    }

    public static String getCity(String area) {
        if (notMatch.contains(area)) {
            return area;
        }
        if (area.length() < 2) {
            return null;
        }
        for (String city : citySet) {
            if (area.contains(city + "市")) {
                return city;
            }
            if (area.contains(city) && !area.contains(city + "省")) {
                return city;
            }
        }

        return null;
    }

    public static String getProvince(String area) {
        if (StringUtils.isBlank(area)) {
            return null;
        }
        if (notMatch.contains(area)) {
            return area;
        }

        if (area.length() < 2) {
            return null;
        }
        //通过省份获得
        for (String prov : provinceSet) {
            if (area.contains(prov)) {
                return prov;
            }
        }
        //通过城市获得省
        String city = getCity(area);
        if (StringUtils.isNotBlank(city)) {
            return cityProvinceMap.get(city);
        }

        return null;
    }

    public static String getCountry(String area) {
        if (notMatch.contains(area)) {
            return area;
        }
        if (StringUtils.contains(area, "省") || StringUtils.contains(area, "市") ||
                StringUtils.contains(area, "香港") ||
                StringUtils.contains(area, "澳门") ||
                StringUtils.contains(area, "台湾")) {
            return "中国";
        }

        //通过省份
        if (StringUtils.isNotBlank(getProvince(area))) {
            return "中国";
        }

        //通过城市
        if (StringUtils.isNotBlank(getCity(area))) {
            return "中国";
        }
        return area;
    }
}
